// При использовании var объявление поднимается в начало контекста (хостинг)
// Поэтому значение "a" "в данный момент будет равно undefined
// Условие не выполнится ("a" есть в window), и значение "a" так и останется undefined
if (!("a" in window)) {
    var a = 1;
}
alert(a);  // undefined

// "a" не определено т.к. объявление функции происходит в контексте выражения объявления и инициализации "b"
var b = function a(x) {
    x && a(--x);
};
alert(a);  // undefined или ошибка

function a(x) {
    return x * 2;
}
var a;
alert(a);  // Выведет тело функции т.к "a" - просто функция без вызова

function b(x, y, a) {
    arguments[2] = 10;  // Меняется значение второго переданного аргумента ("a") на 10
    alert(a);  // 10
}
b(1, 2, 3);

function a() {
    alert(this);
}
a.call(null);  // null заменяется на глобальный объект, будет выведен window. т.е передается, когда не указывается конекст
